---
title: "Download ISO windows .exe files"
date: 2007-04-10
forum: Installation &amp; Upgrades
---

### Post by ubuntumaybe on 2007-04-10
Hi,

I have a duel boot laptop with windows XP and kubuntu 6.06. I downloaded the 6.10 .ISO file to windows XP. I used a downloaded XP program to create the folders and file system contained in the .ISO file. When I attempted to upgrade from my current 6.06 version using the new 6.10 cd I could not. I examined the 6.10 cd file system and found a number of windows .exe files. Did I download the wrong .ISO? I do not have a broadband connection. I would like to upgrade from 6.06 to 6.10. What must I do? Thanks.

Joe

---

### Post by chewearn on 2007-04-10
You have to burn the iso as a disc image to your cd.  Creating folders and copy the files over will not work.

There should be some Windows .exe files in the cd; this is for windows user to try some of the free software that comes with the disc, like firefox, etc.

---

### Post by ubuntumaybe on 2007-04-11
HI,

I guess I did not make myself clear. I actually created the disc image but when I viewed the files in the folder they were windows .exe files. Shoud that be correct? Thanks.

---

### Post by zvacet on 2007-04-11
Just download iso image and burn it very slow without tuch anything on it.Therre is no win exe.files in Ubuntu iso image.

---

### Post by chewearn on 2007-04-11
> **zvacet said:**
> Therre is no win exe.files in Ubuntu iso image.

That's not entirely true.  When I pops in the ubuntu 6.10 disc into a WinXP, it launches an application, which allows me to install abiword, firefox, etc.

I attached some screenshots from windows.

Anyway, back to OP question; did you set the Synaptic to use your CD as the source repo?  (In Synaptic menu > Edit > Add CD-ROM)

---

### Post by ubuntumaybe on 2007-04-11
Hi,

I added the cd to list but I cannot see the files I am looking for like GIMP. I executed the tree /F command in a dos prompt window and saved the results to a file. I have pasted the results below. As you will see there are some .deb files but a number of the files are .exe files for windows specially GIMP. Let me know what you think. Thanks.

---------------------  START --------------------------------------

Folder PATH listing for volume Ubuntu 6.10 i386
Volume serial number is 0006EE48 BF50:53F3
D:.
Ві   README.diskdefines
Ві   autorun.inf
Ві   cdromupgrade
Ві   md5sum.txt
Ві   start.bmp
Ві   start.exe
Ві   start.ini
Ві   ubuntu
Ві   ubuntu.ico
Ві   
ГѓГ„Г„Г„.disk
Ві       info
Ві       
ГѓГ„Г„Г„bin
Ві   Ві   Launch.exe
Ві   Ві   License.txt
Ві   Ві   SetDefault.exe
Ві   Ві   gkgfx.dll
Ві   Ві   js3250.dll
Ві   Ві   jsj3250.dll
Ві   Ві   k-meleon.exe
Ві   Ві   k-meleon.exe.manifest
Ві   Ві   mozctl.dll
Ві   Ві   mozctlx.dll
Ві   Ві   mozilla-ipcd.exe
Ві   Ві   mozz.dll
Ві   Ві   nspr4.dll
Ві   Ві   nssckbi.dll
Ві   Ві   plc4.dll
Ві   Ві   plds4.dll
Ві   Ві   readme.html
Ві   Ві   smime3.dll
Ві   Ві   softokn3.chk
Ві   Ві   ssl3.dll
Ві   Ві   start.ini
Ві   Ві   start2.exe
Ві   Ві   uninstall.exe
Ві   Ві   xpcom.dll
Ві   Ві   xpcom_compat.dll
Ві   Ві   
Ві   ГѓГ„Г„Г„chrome
Ві   Ві   Ві   aggreg8.jar
Ві   Ві   Ві   chrome.rdf
Ві   Ві   Ві   classic.jar
Ві   Ві   Ві   comm.jar
Ві   Ві   Ві   en-US.jar
Ві   Ві   Ві   en-win.jar
Ві   Ві   Ві   flashblock.jar
Ві   Ві   Ві   installed-chrome.txt
Ві   Ві   Ві   pipnss.jar
Ві   Ві   Ві   pippki.jar
Ві   Ві   Ві   toolkit.jar
Ві   Ві   Ві   us.jar
Ві   Ві   Ві   
Ві   Ві   ГѓГ„Г„Г„aggreg8
Ві   Ві   Ві   ГЂГ„Г„Г„content
Ві   Ві   Ві           rssfeeds.rdf
Ві   Ві   Ві           
Ві   Ві   ГЂГ„Г„Г„overlayinfo
Ві   Ві       ГѓГ„Г„Г„browser
Ві   Ві       Ві   ГЂГ„Г„Г„content
Ві   Ві       Ві           overlays.rdf
Ві   Ві       Ві           
Ві   Ві       ГѓГ„Г„Г„communicator
Ві   Ві       Ві   ГЂГ„Г„Г„content
Ві   Ві       Ві           overlays.rdf
Ві   Ві       Ві           
Ві   Ві       ГѓГ„Г„Г„messenger
Ві   Ві       Ві   ГЂГ„Г„Г„content
Ві   Ві       Ві           overlays.rdf
Ві   Ві       Ві           
Ві   Ві       ГЂГ„Г„Г„navigator
Ві   Ві           ГЂГ„Г„Г„content
Ві   Ві                   overlays.rdf
Ві   Ві                   
Ві   ГѓГ„Г„Г„components
Ві   Ві       accessibility-msaa.xpt
Ві   Ві       accessibility.xpt
Ві   Ві       appshell.dll
Ві   Ві       appshell.xpt
Ві   Ві       caps.dll
Ві   Ві       caps.xpt
Ві   Ві       chardet.xpt
Ві   Ві       chrome.dll
Ві   Ві       composer.dll
Ві   Ві       composer.xpt
Ві   Ві       compreg.dat
Ві   Ві       content_base.xpt
Ві   Ві       cookie.dll
Ві   Ві       cookie.xpt
Ві   Ві       docshell.dll
Ві   Ві       docshell_base.xpt
Ві   Ві       dom.xpt
Ві   Ві       dom_base.xpt
Ві   Ві       dom_core.xpt
Ві   Ві       dom_css.xpt
Ві   Ві       dom_events.xpt
Ві   Ві       dom_html.xpt
Ві   Ві       dom_range.xpt
Ві   Ві       dom_stylesheets.xpt
Ві   Ві       dom_traversal.xpt
Ві   Ві       dom_views.xpt
Ві   Ві       dom_xbl.xpt
Ві   Ві       dom_xpath.xpt
Ві   Ві       dom_xul.xpt
Ві   Ві       editor.xpt
Ві   Ві       embed_base.xpt
Ві   Ві       embed_lite.dll
Ві   Ві       embedcomponents.dll
Ві   Ві       gfx.xpt
Ві   Ві       gkgfxwin.dll
Ві   Ві       gklayout.dll
Ві   Ві       gkparser.dll
Ві   Ві       gkwidget.dll
Ві   Ві       i18n.dll
Ві   Ві       imglib2.dll
Ві   Ві       imglib2.xpt
Ві   Ві       intl.xpt
Ві   Ві       intlcmpt.dll
Ві   Ві       intlcmpt.xpt
Ві   Ві       ipcd.xpt
Ві   Ві       ipcdc.dll
Ві   Ві       jar.xpt
Ві   Ві       jar50.dll
Ві   Ві       jsconsole-clhandler.js
Ві   Ві       jsconsole.xpt
Ві   Ві       jsd3250.dll
Ві   Ві       jsdservice.xpt
Ві   Ві       jsurl.xpt
Ві   Ві       layout_base.xpt
Ві   Ві       layout_xul.xpt
Ві   Ві       layout_xul_tree.xpt
Ві   Ві       locale.xpt
Ві   Ві       necko.dll
Ві   Ві       necko.xpt
Ві   Ві       necko2.dll
Ві   Ві       necko_about.xpt
Ві   Ві       necko_cache.xpt
Ві   Ві       necko_cookie.xpt
Ві   Ві       necko_data.xpt
Ві   Ві       necko_dns.xpt
Ві   Ві       necko_file.xpt
Ві   Ві       necko_ftp.xpt
Ві   Ві       necko_http.xpt
Ві   Ві       necko_jar.xpt
Ві   Ві       necko_res.xpt
Ві   Ві       necko_strconv.xpt
Ві   Ві       necko_viewsource.xpt
Ві   Ві       nsProxyAutoConfig.js
Ві   Ві       nsSidebar.js
Ві   Ві       oji.dll
Ві   Ві       oji.xpt
Ві   Ві       p3p.dll
Ві   Ві       p3p.xpt
Ві   Ві       pipboot.dll
Ві   Ві       pipboot.xpt
Ві   Ві       pipnss.xpt
Ві   Ві       pippki.dll
Ві   Ві       pippki.xpt
Ві   Ві       pref.xpt
Ві   Ві       profile.dll
Ві   Ві       profile.xpt
Ві   Ві       rdf.dll
Ві   Ві       rdf.xpt
Ві   Ві       shistory.xpt
Ві   Ві       sidebar.xpt
Ві   Ві       txmgr.dll
Ві   Ві       txmgr.xpt
Ві   Ві       txtsvc.xpt
Ві   Ві       typeaheadfind.dll
Ві   Ві       typeaheadfind.xpt
Ві   Ві       uconv.dll
Ві   Ві       uconv.xpt
Ві   Ві       ucvmath.dll
Ві   Ві       unicharutil.xpt
Ві   Ві       universalchardet.dll
Ві   Ві       uriloader.xpt
Ві   Ві       wallet.dll
Ві   Ві       wallet.xpt
Ві   Ві       walleteditor.xpt
Ві   Ві       walletpreview.xpt
Ві   Ві       webBrowser_core.xpt
Ві   Ві       webbrwsr.dll
Ві   Ві       widget.xpt
Ві   Ві       windowwatcher.xpt
Ві   Ві       xmlextras.dll
Ві   Ві       xmlextras.xpt
Ві   Ві       xpc3250.dll
Ві   Ві       xpcom_base.xpt
Ві   Ві       xpcom_compat_c.dll
Ві   Ві       xpcom_components.xpt
Ві   Ві       xpcom_ds.xpt
Ві   Ві       xpcom_io.xpt
Ві   Ві       xpcom_obsolete.xpt
Ві   Ві       xpcom_thread.xpt
Ві   Ві       xpcom_xpti.xpt
Ві   Ві       xpconnect.xpt
Ві   Ві       xppref32.dll
Ві   Ві       xpti.dat
Ві   Ві       xuldoc.xpt
Ві   Ві       
Ві   ГѓГ„Г„Г„defaults
Ві   Ві   ГѓГ„Г„Г„autoconfig
Ві   Ві   Ві       platform.js
Ві   Ві   Ві       prefcalls.js
Ві   Ві   Ві       
Ві   Ві   ГѓГ„Г„Г„pref
Ві   Ві   Ві       all.js
Ві   Ві   Ві       security-prefs.js
Ві   Ві   Ві       winpref.js
Ві   Ві   Ві       
Ві   Ві   ГѓГ„Г„Г„profile
Ві   Ві   Ві   Ві   Prefs.js
Ві   Ві   Ві   Ві   accel.cfg
Ві   Ві   Ві   Ві   cookies.txt
Ві   Ві   Ві   Ві   cookperm.txt
Ві   Ві   Ві   Ві   history.txt
Ві   Ві   Ві   Ві   localstore.rdf
Ві   Ві   Ві   Ві   macros.cfg
Ві   Ві   Ві   Ві   menus.cfg
Ві   Ві   Ві   Ві   mimeTypes.rdf
Ві   Ві   Ві   Ві   user.js
Ві   Ві   Ві   Ві   
Ві   Ві   Ві   ГЂГ„Г„Г„chrome
Ві   Ві   Ві           userChrome.css
Ві   Ві   Ві           userContent.css
Ві   Ві   Ві           
Ві   Ві   ГЂГ„Г„Г„wallet
Ві   Ві           DistinguishedSchema.tbl
Ві   Ві           FieldSchema.tbl
Ві   Ві           PositionalSchema.tbl
Ві   Ві           SchemaConcat.tbl
Ві   Ві           SchemaStrings.tbl
Ві   Ві           StateSchema.tbl
Ві   Ві           VcardSchema.tbl
Ві   Ві           
Ві   ГѓГ„Г„Г„greprefs
Ві   Ві       all.js
Ві   Ві       non-shared.txt
Ві   Ві       security-prefs.js
Ві   Ві       xpinstall.js
Ві   Ві       
Ві   ГѓГ„Г„Г„ipc
Ві   Ві   ГЂГ„Г„Г„modules
Ві   Ві           lockmodule.dll
Ві   Ві           transmgr.dll
Ві   Ві           
Ві   ГѓГ„Г„Г„kplugins
Ві   Ві       macros.dll
Ві   Ві       
Ві   ГѓГ„Г„Г„plugins
Ві   Ві       npnul32.dll
Ві   Ві       
Ві   ГЂГ„Г„Г„res
Ві       Ві   EditorOverride.css
Ві       Ві   arrow.gif
Ві       Ві   arrowd.gif
Ві       Ві   broken-image.gif
Ві       Ві   charsetData.properties
Ві       Ві   charsetalias.properties
Ві       Ві   cmessage.txt
Ві       Ві   forms.css
Ві       Ві   grabber.gif
Ві       Ві   html.css
Ві       Ві   langGroups.properties
Ві       Ві   language.properties
Ві       Ві   loading-image.gif
Ві       Ві   mathml.css
Ві       Ві   platform-forms.css
Ві       Ві   quirk.css
Ві       Ві   ua.css
Ві       Ві   viewsource.css
Ві       Ві   wincharset.properties
Ві       Ві   
Ві       ГѓГ„Г„Г„builtin
Ві       Ві       htmlBindings.xml
Ві       Ві       platformHTMLBindings.xml
Ві       Ві       
Ві       ГѓГ„Г„Г„dtd
Ві       Ві       mathml.dtd
Ві       Ві       xhtml11.dtd
Ві       Ві       
Ві       ГѓГ„Г„Г„entityTables
Ві       Ві       html40Latin1.properties
Ві       Ві       html40Special.properties
Ві       Ві       html40Symbols.properties
Ві       Ві       htmlEntityVersions.properties
Ві       Ві       mathml20.properties
Ві       Ві       transliterate.properties
Ві       Ві       
Ві       ГѓГ„Г„Г„fonts
Ві       Ві       fontEncoding.properties
Ві       Ві       mathfont.properties
Ві       Ві       mathfontCMEX10.properties
Ві       Ві       mathfontCMSY10.properties
Ві       Ві       mathfontMTExtra.properties
Ві       Ві       mathfontMath1.properties
Ві       Ві       mathfontMath2.properties
Ві       Ві       mathfontMath4.properties
Ві       Ві       mathfontPUA.properties
Ві       Ві       mathfontSymbol.properties
Ві       Ві       
Ві       ГЂГ„Г„Г„html
Ві               gopher-audio.gif
Ві               gopher-binary.gif
Ві               gopher-find.gif
Ві               gopher-image.gif
Ві               gopher-menu.gif
Ві               gopher-movie.gif
Ві               gopher-sound.gif
Ві               gopher-telnet.gif
Ві               gopher-text.gif
Ві               gopher-unknown.gif
Ві               
ГѓГ„Г„Г„casper
Ві       filesystem.manifest
Ві       filesystem.manifest-desktop
Ві       filesystem.squashfs
Ві       initrd.gz
Ві       vmlinuz
Ві       
ГѓГ„Г„Г„disctree
Ві   ГѓГ„Г„Г„app_img
Ві   Ві       abiword_01.png
Ві   Ві       abiword_01_tn.png
Ві   Ві       abiword_02.png
Ві   Ві       abiword_02_tn.png
Ві   Ві       firefox_01.png
Ві   Ві       firefox_01_tn.png
Ві   Ві       firefox_02.png
Ві   Ві       firefox_02_tn.png
Ві   Ві       gaim_01.png
Ві   Ві       gaim_01_tn.png
Ві   Ві       gimp_01.png
Ві   Ві       gimp_01_tn.png
Ві   Ві       gimp_02.png
Ві   Ві       gimp_02_tn.png
Ві   Ві       opencd_01.png
Ві   Ві       opencd_01_tn.png
Ві   Ві       opencd_02.png
Ві   Ві       opencd_02_tn.png
Ві   Ві       thunderbird_01.png
Ві   Ві       thunderbird_01_tn.png
Ві   Ві       thunderbird_02.png
Ві   Ві       thunderbird_02_tn.png
Ві   Ві       ubuntu-addapp.png
Ві   Ві       ubuntu-addapp_tn.png
Ві   Ві       ubuntu-desktop.png
Ві   Ві       ubuntu-desktop_tn.png
Ві   Ві       ubuntu-gimp.png
Ві   Ві       ubuntu-gimp_tn.png
Ві   Ві       ubuntu-nautilus.png
Ві   Ві       ubuntu-nautilus_tn.png
Ві   Ві       ubuntu_225.png
Ві   Ві       
Ві   ГѓГ„Г„Г„en
Ві   Ві       abiword.html
Ві   Ві       abiword_install.lch
Ві   Ві       abiword_web.lch
Ві   Ві       aboutgtk.html
Ві   Ві       firefox.html
Ві   Ві       firefox_install.lch
Ві   Ві       firefox_web.lch
Ві   Ві       gaim.html
Ві   Ві       gaim_install.lch
Ві   Ві       gaim_web.lch
Ві   Ві       gimp.html
Ві   Ві       gimp_install.lch
Ві   Ві       gimp_web.lch
Ві   Ві       gtk_install.lch
Ві   Ві       gtk_web.lch
Ві   Ві       home.html
Ві   Ві       opencd.html
Ві   Ві       opencd_web.lch
Ві   Ві       theopencd_web.lch
Ві   Ві       thunderbird.html
Ві   Ві       thunderbird_install.lch
Ві   Ві       thunderbird_web.lch
Ві   Ві       ubuntu.html
Ві   Ві       ubuntu_web.lch
Ві   Ві       
Ві   ГЂГ„Г„Г„incl
Ві       Ві   InfoWindow.html
Ві       Ві   forum_web.lch
Ві       Ві   kmeleon_web.lch
Ві       Ві   orchard_web.lch
Ві       Ві   source_web.lch
Ві       Ві   
Ві       ГѓГ„Г„Г„css
Ві       Ві       app_page.css
Ві       Ві       common.css
Ві       Ві       info_page.css
Ві       Ві       main_page.css
Ві       Ві       
Ві       ГѓГ„Г„Г„img
Ві       Ві       abiword.png
Ві       Ві       backarrow.png
Ві       Ві       bkg.jpg
Ві       Ві       body_btm.png
Ві       Ві       bullet.png
Ві       Ві       exit.png
Ві       Ві       firefox.png
Ві       Ві       gaim.png
Ві       Ві       gimp.png
Ві       Ві       globe-s.png
Ві       Ві       gohome.png
Ві       Ві       gtk-big.png
Ві       Ві       gtk.png
Ві       Ві       info-i.png
Ві       Ві       install-s.png
Ві       Ві       install.png
Ві       Ві       opencd.png
Ві       Ві       shadow200.png
Ві       Ві       shadow225.png
Ві       Ві       shadow250.png
Ві       Ві       shadow250b.png
Ві       Ві       thunderbird.png
Ві       Ві       top_amber.png
Ві       Ві       ubuntu-logo-large.png
Ві       Ві       ubuntu-logo-small.png
Ві       Ві       ubuntu.png
Ві       Ві       white.png
Ві       Ві       
Ві       ГЂГ„Г„Г„js
Ві               ocd_common.js
Ві               
ГѓГ„Г„Г„dists
Ві   Ві   stable
Ві   Ві   unstable
Ві   Ві   
Ві   ГЂГ„Г„Г„edgy
Ві       Ві   Release
Ві       Ві   Release.gpg
Ві       Ві   
Ві       ГѓГ„Г„Г„main
Ві       Ві   ГѓГ„Г„Г„binary-i386
Ві       Ві   Ві       Packages
Ві       Ві   Ві       Packages.gz
Ві       Ві   Ві       Release
Ві       Ві   Ві       
Ві       Ві   ГѓГ„Г„Г„dist-upgrader
Ві       Ві   Ві   ГЂГ„Г„Г„binary-all
Ві       Ві   Ві           edgy.tar.gz
Ві       Ві   Ві           edgy.tar.gz.gpg
Ві       Ві   Ві           
Ві       Ві   ГЂГ„Г„Г„source
Ві       ГЂГ„Г„Г„restricted
Ві           ГѓГ„Г„Г„binary-i386
Ві           Ві       Packages
Ві           Ві       Packages.gz
Ві           Ві       Release
Ві           Ві       
Ві           ГЂГ„Г„Г„source
ГѓГ„Г„Г„install
Ві       README.sbm
Ві       mt86plus
Ві       sbm.bin
Ві       
ГѓГ„Г„Г„isolinux
Ві       16x16.fnt
Ві       af.tr
Ві       ar.tr
Ві       back.jpg
Ві       be.tr
Ві       bg.tr
Ві       bn.tr
Ві       boot.cat
Ві       bootlogo
Ві       br.tr
Ві       ca.tr
Ві       cs.tr
Ві       csb.tr
Ві       da.tr
Ві       de.hlp
Ві       de.tr
Ві       el.tr
Ві       en.hlp
Ві       en.tr
Ві       eo.tr
Ві       es.hlp
Ві       es.tr
Ві       et.tr
Ві       eu.hlp
Ві       eu.tr
Ві       f1.txt
Ві       f10.txt
Ві       f2.txt
Ві       f3.txt
Ві       f3.txt.withgtk
Ві       f4.txt
Ві       f4.txt.withgtk
Ві       f5.txt
Ві       f6.txt
Ві       f7.txt
Ві       f8.txt
Ві       f9.txt
Ві       fa.tr
Ві       fi.hlp
Ві       fi.tr
Ві       fil.tr
Ві       fr.hlp
Ві       fr.tr
Ві       ga.tr
Ві       gl.hlp
Ві       gl.tr
Ві       hi.tr
Ві       hr.tr
Ві       hu.hlp
Ві       hu.tr
Ві       id.hlp
Ві       id.tr
Ві       is.tr
Ві       isolinux.bin
Ві       isolinux.cfg
Ві       isolinux.txt
Ві       it.tr
Ві       ja.tr
Ві       ka.hlp
Ві       ka.tr
Ві       kn.tr
Ві       ko.hlp
Ві       ko.tr
Ві       ku.tr
Ві       langlist
Ві       lt.tr
Ві       lv.tr
Ві       mk.tr
Ві       mn.tr
Ві       ms.tr
Ві       nb.tr
Ві       nds.tr
Ві       nl.hlp
Ві       nl.tr
Ві       oc.tr
Ві       pl.hlp
Ві       pl.tr
Ві       pt.hlp
Ві       pt.tr
Ві       pt_BR.hlp
Ві       pt_BR.tr
Ві       ro.tr
Ві       ru.hlp
Ві       ru.tr
Ві       sk.hlp
Ві       sk.tr
Ві       sl.tr
Ві       so.tr
Ві       splash.pcx
Ві       splash.rle
Ві       sq.tr
Ві       sr.tr
Ві       sv.hlp
Ві       sv.tr
Ві       ta.tr
Ві       th.tr
Ві       tr.tr
Ві       uk.tr
Ві       ur.tr
Ві       vi.tr
Ві       zh_CN.hlp
Ві       zh_CN.tr
Ві       zh_TW.tr
Ві       
ГѓГ„Г„Г„pics
Ві       blue-lowerleft.png
Ві       blue-lowerright.png
Ві       blue-upperleft.png
Ві       blue-upperright.png
Ві       debian.jpg
Ві       logo-50.jpg
Ві       red-lowerleft.png
Ві       red-lowerright.png
Ві       red-upperleft.png
Ві       red-upperright.png
Ві       
ГѓГ„Г„Г„pool
Ві   ГѓГ„Г„Г„main
Ві   Ві   ГѓГ„Г„Г„b
Ві   Ві   Ві   ГѓГ„Г„Г„bpalogin
Ві   Ві   Ві   Ві       bpalogin_2.0.2-9ubuntu1_i386.deb
Ві   Ві   Ві   Ві       
Ві   Ві   Ві   ГЂГ„Г„Г„build-essential
Ві   Ві   Ві           build-essential_11.3_i386.deb
Ві   Ві   Ві           
Ві   Ві   ГѓГ„Г„Г„d
Ві   Ві   Ві   ГЂГ„Г„Г„dpkg
Ві   Ві   Ві           dpkg-dev_1.13.22ubuntu7_all.deb
Ві   Ві   Ві           
Ві   Ві   ГѓГ„Г„Г„e
Ві   Ві   Ві   ГЂГ„Г„Г„eagle-usb
Ві   Ві   Ві           eagle-usb-data_2.1.1-2ubuntu1_all.deb
Ві   Ві   Ві           eagle-usb-utils_2.1.1-2ubuntu1_i386.deb
Ві   Ві   Ві           
Ві   Ві   ГѓГ„Г„Г„f
Ві   Ві   Ві   ГЂГ„Г„Г„fakeroot
Ві   Ві   Ві           fakeroot_1.5.9ubuntu1_i386.deb
Ві   Ві   Ві           
Ві   Ві   ГѓГ„Г„Г„g
Ві   Ві   Ві   ГѓГ„Г„Г„gcc-4.1
Ві   Ві   Ві   Ві       g++-4.1_4.1.1-13ubuntu5_i386.deb
Ві   Ві   Ві   Ві       libstdc++6-4.1-dev_4.1.1-13ubuntu5_i386.deb
Ві   Ві   Ві   Ві       
Ві   Ві   Ві   ГѓГ„Г„Г„gcc-defaults
Ві   Ві   Ві   Ві       g++_4.1.1-6ubuntu3_i386.deb
Ві   Ві   Ві   Ві       
Ві   Ві   Ві   ГЂГ„Г„Г„glibc
Ві   Ві   Ві           libc6-dev_2.4-1ubuntu12_i386.deb
Ві   Ві   Ві           
Ві   Ві   ГѓГ„Г„Г„i
Ві   Ві   Ві   ГЂГ„Г„Г„isdnutils
Ві   Ві   Ві           capiutils_3.9.20060704-1_i386.deb
Ві   Ві   Ві           ipppd_3.9.20060704-1_i386.deb
Ві   Ві   Ві           isdnutils-base_3.9.20060704-1_i386.deb
Ві   Ві   Ві           isdnutils-xtools_3.9.20060704-1_i386.deb
Ві   Ві   Ві           libcapi20-3_3.9.20060704-1_i386.deb
Ві   Ві   Ві           libcapi20-dev_3.9.20060704-1_i386.deb
Ві   Ві   Ві           pppdcapiplugin_3.9.20060704-1_i386.deb
Ві   Ві   Ві           
Ві   Ві   ГѓГ„Г„Г„l
Ві   Ві   Ві   ГѓГ„Г„Г„linux-atm
Ві   Ві   Ві   Ві       libatm1_2.4.1-17_i386.deb
Ві   Ві   Ві   Ві       
Ві   Ві   Ві   ГѓГ„Г„Г„linux-source-2.6.17
Ві   Ві   Ві   Ві       linux-libc-dev_2.6.17-10.33_i386.deb
Ві   Ві   Ві   Ві       
Ві   Ві   Ві   ГЂГ„Г„Г„linux-wlan-ng
Ві   Ві   Ві           linux-wlan-ng_0.2.5-2ubuntu1_i386.deb
Ві   Ві   Ві           
Ві   Ві   ГѓГ„Г„Г„n
Ві   Ві   Ві   ГѓГ„Г„Г„ndiswrapper
Ві   Ві   Ві   Ві       ndiswrapper-common_1.18-1ubuntu2_all.deb
Ві   Ві   Ві   Ві       ndiswrapper-utils-1.8_1.18-1ubuntu2_i386.deb
Ві   Ві   Ві   Ві       
Ві   Ві   Ві   ГЂГ„Г„Г„ndiswrapper-1.1
Ві   Ві   Ві           ndiswrapper-utils-1.1_1.1-5_i386.deb
Ві   Ві   Ві           ndiswrapper-utils_1.1-5_all.deb
Ві   Ві   Ві           
Ві   Ві   ГѓГ„Г„Г„p
Ві   Ві   Ві   ГЂГ„Г„Г„pptp-linux
Ві   Ві   Ві           pptp-linux_1.7.0-2ubuntu1_i386.deb
Ві   Ві   Ві           
Ві   Ві   ГЂГ„Г„Г„s
Ві   Ві       ГЂГ„Г„Г„setserial
Ві   Ві               setserial_2.17-43_i386.deb
Ві   Ві               
Ві   ГЂГ„Г„Г„restricted
Ві       ГѓГ„Г„Г„d
Ві       Ві   ГЂГ„Г„Г„drdsl
Ві       Ві           drdsl_1.2.0-1_i386.deb
Ві       Ві           
Ві       ГЂГ„Г„Г„l
Ві           ГѓГ„Г„Г„linux-meta
Ві           Ві       avm-fritz-firmware_2.6.17.10_i386.deb
Ві           Ві       
Ві           ГЂГ„Г„Г„linux-restricted-modules-2.6.17
Ві                   avm-fritz-firmware-2.6.17-10_3.11+2.6.17.5-11_i386.deb
Ві                   
ГѓГ„Г„Г„preseed
Ві       cli.seed
Ві       ubuntu.seed
Ві       
ГЂГ„Г„Г„programs
    ГѓГ„Г„Г„abiword
    Ві       AbiwordSetup.exe
    Ві       
    ГѓГ„Г„Г„firefox
    Ві       FirefoxSetup.exe
    Ві       
    ГѓГ„Г„Г„gaim
    Ві       GaimSetup.exe
    Ві       
    ГѓГ„Г„Г„gimp
    Ві       GimpSetup.exe
    Ві       
    ГѓГ„Г„Г„gtk
    Ві       GTKSetup.exe
    Ві       
    ГЂГ„Г„Г„thunderbird
            ThunderbirdSetup.exe

---------------------  END  --------------------------------------

---

### Post by chewearn on 2007-04-12
Unfortunately, I am not sure how the CD repo works.  I once did a thorough examination of the liveCD, I found out that the deb files are "packaged/zipped" inside a large file in the cd, meaning you will not see the deb simply by list the filesystem.

What I can only say for sure is that the windows exe files are not a problem; they are all supposed to be there in the Programs directory.

Maybe, for some reasons, a Dapper system simply does not allow you to add Edgy CD as a repo; I just don't know.

---

### Post by Ptero-4 on 2007-12-12
The Desktop CD cannot be used for upgrading a previous version. You need the alternate CD to do that since it's the one that works more similar to the breezy and earlier versions installation CDs.

---

